app/controllers/api/customers_controller.rb

  def index
    respond_with Customer.order(companyregdate: :DESC)
---
SELECT "customers".* FROM "customers" ORDER BY "customers"."companyregdate" DESC

  def show
    respond_with Customer.find(params[:id])
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    respond_with :api, Customer.create(customer_params)
---
INSERT INTO "customers" ("address", "name", "ssn", "company", "registered", "companyregdate", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def destroy
    respond_with Customer.destroy(params[:id])
---
DELETE FROM "customers" WHERE "customers"."id" = ?  [["id", 2]]

  def update
    customer = Customer.find(params['id'])
    customer.update(customer_params)
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "customers" SET "address" = ?, "updated_at" = ? WHERE "customers"."id" = ?  [["address", "345 South Sandiego Street, SanDiego, USA"], ["updated_at", "2021-06-01 19:50:42.029354"], ["id", 5]]